layers/auto-completion/README.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2015-11-23 Mon 13:48 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="viewport" content="width=device-width, initial-scale=1" />
<title>Auto-completion layer</title>
<meta  name="generator" content="Org-mode" />
<link rel="stylesheet" type="text/css"
                 href="http://www.pirilampo.org/styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="../../css/readtheorg.css" />
</head>
<body>
<div id="content">
<div id="toggle-sidebar"><a href="#table-of-contents"><h2>Table of Contents</h2></a></div>
<h1 class="title">Auto-completion layer</h1>
<div id="table-of-contents">
<h2>Table of Contents<a href="#">Close</a></h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgheadline1">1. Description</a></li>
<li><a href="#orgheadline2">2. Install</a></li>
<li><a href="#orgheadline12">3. Configuration</a>
<ul>
<li><a href="#orgheadline3">3.1. Key bindings</a></li>
<li><a href="#orgheadline4">3.2. Tooltips</a></li>
<li><a href="#orgheadline5">3.3. Sort results by usage</a></li>
<li><a href="#orgheadline6">3.4. Show snippets in auto-completion popup</a></li>
<li><a href="#orgheadline7">3.5. Enable company or auto-complete globally</a></li>
<li><a href="#orgheadline8">3.6. Replacing company by auto-complete</a></li>
<li><a href="#orgheadline11">3.7. Add auto-completion in a layer</a>
<ul>
<li><a href="#orgheadline9">3.7.1. In <code>config.el</code></a></li>
<li><a href="#orgheadline10">3.7.2. In <code>packages.el</code></a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgheadline17">4. Key Bindings</a>
<ul>
<li><a href="#orgheadline13">4.1. Company</a></li>
<li><a href="#orgheadline14">4.2. Auto-complete</a></li>
<li><a href="#orgheadline15">4.3. Yasnippet</a></li>
<li><a href="#orgheadline16">4.4. Auto-yasnippet</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline1" class="outline-2">
<h2 id="orgheadline1"><span class="section-number-2">1</span> Description</h2>
<div class="outline-text-2" id="text-1">
<p>
This layer provides auto-completion to Spacemacs.
</p>

<p>
The following completion engines are supported:
</p>
<ul class="org-ul">
<li><a href="http://company-mode.github.io/">company</a></li>
<li><a href="http://auto-complete.org/">auto-complete</a></li>
</ul>

<p>
Snippets are supported via <a href="https://github.com/capitaomorte/yasnippet">yasnippet</a> and <a href="https://github.com/abo-abo/auto-yasnippet">auto-yasnippet</a>.
</p>

<p>
This layer also configures <code>hippie-expand</code>.
</p>
</div>
</div>

<div id="outline-container-orgheadline2" class="outline-2">
<h2 id="orgheadline2"><span class="section-number-2">2</span> Install</h2>
<div class="outline-text-2" id="text-2">
<p>
To use this configuration layer add it to your <code>~/.spacemacs</code>
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp"><span class="org-rainbow-delimiters-depth-1">(</span>setq-default dotspacemacs-configuration-layers '<span class="org-rainbow-delimiters-depth-2">(</span>auto-completion<span class="org-rainbow-delimiters-depth-2">)</span><span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline12" class="outline-2">
<h2 id="orgheadline12"><span class="section-number-2">3</span> Configuration</h2>
<div class="outline-text-2" id="text-3">
</div><div id="outline-container-orgheadline3" class="outline-3">
<h3 id="orgheadline3"><span class="section-number-3">3.1</span> Key bindings</h3>
<div class="outline-text-3" id="text-3-1">
<p>
You can customize the user experience of auto-completion with the following
layer variables:
</p>

<ol class="org-ol">
<li><code>auto-completion-return-key-behavior</code> set the action to perform when the
<code>RET</code> key is pressed, the possible values are:
<ul class="org-ul">
<li><code>complete</code> completes with the current selection</li>
<li><code>nil</code> does nothing</li>
</ul></li>

<li><code>auto-completion-tab-key-behavior</code> set the action to perform when the <code>TAB</code>
   key is pressed, the possible values are:
<ul class="org-ul">
<li><code>complete</code> completes with the current selection</li>
<li><code>cycle</code> completes the common prefix and cycle between candidates</li>
<li><code>nil</code> does nothing</li>
</ul></li>

<li><code>auto-completion-complete-with-key-sequence</code> is a string of two characters
denoting a key sequence that will perform a <code>complete</code> action if the sequence
as been entered quickly enough. If its value is <code>nil</code> then the feature is
disabled.</li>

<li><code>auto-completion-private-snippets-directory</code> is a path to your private
snippets directory. If its value is <code>nil</code> then the spacemacs default is used.</li>
</ol>

<p>
The default configuration of the layer is:
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp"><span class="org-rainbow-delimiters-depth-1">(</span>setq-default dotspacemacs-configuration-layers '<span class="org-rainbow-delimiters-depth-2">(</span>
  <span class="org-rainbow-delimiters-depth-3">(</span>auto-completion <span class="org-builtin">:variables</span>
                   auto-completion-return-key-behavior 'complete
                   auto-completion-tab-key-behavior 'cycle
                   auto-completion-complete-with-key-sequence nil
                   auto-completion-private-snippets-directory nil<span class="org-rainbow-delimiters-depth-3">)</span>
                   <span class="org-rainbow-delimiters-depth-2">)</span><span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>

<p>
<code>jk</code> is a good candidate for <code>auto-completion-complete-with-key-sequence</code> if
you don't use it already.
</p>
</div>
</div>

<div id="outline-container-orgheadline4" class="outline-3">
<h3 id="orgheadline4"><span class="section-number-3">3.2</span> Tooltips</h3>
<div class="outline-text-3" id="text-3-2">
<p>
To enable docstring tooltips set <code>auto-completion-enable-help-tooltip</code> to <code>t</code>
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp"><span class="org-rainbow-delimiters-depth-1">(</span>setq-default dotspacemacs-configuration-layers
  '<span class="org-rainbow-delimiters-depth-2">(</span>auto-completion <span class="org-builtin">:variables</span>
                    auto-completion-enable-help-tooltip t<span class="org-rainbow-delimiters-depth-2">)</span><span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline5" class="outline-3">
<h3 id="orgheadline5"><span class="section-number-3">3.3</span> Sort results by usage</h3>
<div class="outline-text-3" id="text-3-3">
<p>
To enable sorting auto-completion results by their usage frequency set
<code>auto-completion-enable-sort-by-usage</code> to <code>t</code>.
This feature is provided by the <a href="https://github.com/company-mode/company-statistics">company-statistics</a> package when <code>company</code>
is used.
The variable has no effect when <code>auto-complete</code> is used.
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp"><span class="org-rainbow-delimiters-depth-1">(</span>setq-default dotspacemacs-configuration-layers
  '<span class="org-rainbow-delimiters-depth-2">(</span>auto-completion <span class="org-builtin">:variables</span>
                    auto-completion-enable-sort-by-usage t<span class="org-rainbow-delimiters-depth-2">)</span><span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline6" class="outline-3">
<h3 id="orgheadline6"><span class="section-number-3">3.4</span> Show snippets in auto-completion popup</h3>
<div class="outline-text-3" id="text-3-4">
<p>
By default, snippets are not shown in the auto-completion popup. To show them in
the popup, set the variable <code>auto-completion-enable-snippets-in-popup</code> to <code>t</code>.
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp"><span class="org-rainbow-delimiters-depth-1">(</span>setq-default dotspacemacs-configuration-layers
              '<span class="org-rainbow-delimiters-depth-2">(</span><span class="org-rainbow-delimiters-depth-3">(</span>auto-completion <span class="org-builtin">:variables</span>
                                 auto-completion-enable-snippets-in-popup t<span class="org-rainbow-delimiters-depth-3">)</span><span class="org-rainbow-delimiters-depth-2">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline7" class="outline-3">
<h3 id="orgheadline7"><span class="section-number-3">3.5</span> Enable company or auto-complete globally</h3>
<div class="outline-text-3" id="text-3-5">
<p>
By default Spacemacs enables auto-completion explicitly for each supported
major-mode, it means that <code>company</code> and <code>auto-complete</code> are not enabled
globally, it allows more flexibility to choose an auto-completion engine
for a given mode.
</p>

<p>
You may want to enable company globally to get auto-completion
everywhere even in the modes which are not configured by Spacemacs. To do
so, you just have to add <code>(global-company-mode)</code> in the
<code>dotspacemacs/user -config</code> function of your dotfile.
</p>

<p>
Note that if you want to enable <code>auto-complete</code> globally you will have to
disable <code>company</code> first, see the next section to do so.
</p>
</div>
</div>

<div id="outline-container-orgheadline8" class="outline-3">
<h3 id="orgheadline8"><span class="section-number-3">3.6</span> Replacing company by auto-complete</h3>
<div class="outline-text-3" id="text-3-6">
<p>
You can disable <code>company</code> by adding it to the <code>dotspacemacs-excluded-packages</code>
variable, then you are free to enable <code>auto-complete</code> globally.
</p>
</div>
</div>

<div id="outline-container-orgheadline11" class="outline-3">
<h3 id="orgheadline11"><span class="section-number-3">3.7</span> Add auto-completion in a layer</h3>
<div class="outline-text-3" id="text-3-7">
<p>
Here is an example to add <code>company</code> auto-completion to python buffer:
</p>
</div>

<div id="outline-container-orgheadline9" class="outline-4">
<h4 id="orgheadline9"><span class="section-number-4">3.7.1</span> In <code>config.el</code></h4>
<div class="outline-text-4" id="text-3-7-1">
<div class="org-src-container">

<pre class="src src-emacs-lisp"><span class="org-comment-delimiter">;; </span><span class="org-comment">Define the buffer local company backend variable</span>
<span class="org-rainbow-delimiters-depth-1">(</span>spacemacs|defvar-company-backends python-mode<span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline10" class="outline-4">
<h4 id="orgheadline10"><span class="section-number-4">3.7.2</span> In <code>packages.el</code></h4>
<div class="outline-text-4" id="text-3-7-2">
<div class="org-src-container">

<pre class="src src-emacs-lisp"><span class="org-comment-delimiter">;; </span><span class="org-comment">Add the relevant packages to the layer</span>
<span class="org-rainbow-delimiters-depth-1">(</span>setq python-packages
  '<span class="org-rainbow-delimiters-depth-2">(</span>...
    company
    company-anaconda
    ...<span class="org-rainbow-delimiters-depth-2">)</span><span class="org-rainbow-delimiters-depth-1">)</span>

<span class="org-comment-delimiter">;; </span><span class="org-comment">Configure the packages</span>
<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">when</span> <span class="org-rainbow-delimiters-depth-2">(</span>configuration-layer/layer-usedp 'auto-completion<span class="org-rainbow-delimiters-depth-2">)</span>

  <span class="org-comment-delimiter">;; </span><span class="org-comment">Hook company to python-mode</span>
  <span class="org-rainbow-delimiters-depth-2">(</span><span class="org-keyword">defun</span> <span class="org-function-name">python/post-init-company</span> <span class="org-rainbow-delimiters-depth-3">()</span>
    <span class="org-rainbow-delimiters-depth-3">(</span>spacemacs|add-company-hook python-mode<span class="org-rainbow-delimiters-depth-3">)</span><span class="org-rainbow-delimiters-depth-2">)</span>

  <span class="org-comment-delimiter">;; </span><span class="org-comment">Add the backend to the major-mode specific backend list</span>
  <span class="org-rainbow-delimiters-depth-2">(</span><span class="org-keyword">defun</span> <span class="org-function-name">python/init-company-anaconda</span> <span class="org-rainbow-delimiters-depth-3">()</span>
    <span class="org-rainbow-delimiters-depth-3">(</span><span class="org-keyword">use-package</span> <span class="org-constant">company-anaconda</span>
      <span class="org-builtin">:if</span> <span class="org-rainbow-delimiters-depth-4">(</span>configuration-layer/package-usedp 'company<span class="org-rainbow-delimiters-depth-4">)</span>
      <span class="org-builtin">:defer</span> t
      <span class="org-builtin">:init</span> <span class="org-rainbow-delimiters-depth-4">(</span>push 'company-anaconda company-backends-python-mode<span class="org-rainbow-delimiters-depth-4">)</span><span class="org-rainbow-delimiters-depth-3">)</span><span class="org-rainbow-delimiters-depth-2">)</span><span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>
</div>
</div>
</div>
</div>

<div id="outline-container-orgheadline17" class="outline-2">
<h2 id="orgheadline17"><span class="section-number-2">4</span> Key Bindings</h2>
<div class="outline-text-2" id="text-4">
</div><div id="outline-container-orgheadline13" class="outline-3">
<h3 id="orgheadline13"><span class="section-number-3">4.1</span> Company</h3>
<div class="outline-text-3" id="text-4-1">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Key Binding</th>
<th scope="col" class="org-left">Description</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><code>C-j</code></td>
<td class="org-left">go down in company dropdown menu</td>
</tr>

<tr>
<td class="org-left"><code>C-k</code></td>
<td class="org-left">go up in company dropdown menu</td>
</tr>

<tr>
<td class="org-left"><code>C-/</code></td>
<td class="org-left">show candidates in Helm (for fuzzy searching)</td>
</tr>

<tr>
<td class="org-left"><code>C-M-/</code></td>
<td class="org-left">filter the company dropdown menu</td>
</tr>

<tr>
<td class="org-left"><code>C-d</code></td>
<td class="org-left">open minibuffer with documentation of thing at point in company dropdown</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-orgheadline14" class="outline-3">
<h3 id="orgheadline14"><span class="section-number-3">4.2</span> Auto-complete</h3>
<div class="outline-text-3" id="text-4-2">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Key Binding</th>
<th scope="col" class="org-left">Description</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><code>C-j</code></td>
<td class="org-left">select next candidate</td>
</tr>

<tr>
<td class="org-left"><code>C-k</code></td>
<td class="org-left">select previous candidate</td>
</tr>

<tr>
<td class="org-left"><code>TAB</code></td>
<td class="org-left">expand selection or select next candidate</td>
</tr>

<tr>
<td class="org-left"><code>S-TAB</code></td>
<td class="org-left">select previous candidate</td>
</tr>

<tr>
<td class="org-left"><code>return</code></td>
<td class="org-left">complete word, if word is already completed insert a carriage return</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-orgheadline15" class="outline-3">
<h3 id="orgheadline15"><span class="section-number-3">4.3</span> Yasnippet</h3>
<div class="outline-text-3" id="text-4-3">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Key Binding</th>
<th scope="col" class="org-left">Description</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><code>M-/</code></td>
<td class="org-left">Expand a snippet if text before point is a prefix of a snippet</td>
</tr>

<tr>
<td class="org-left"><code>SPC i s</code></td>
<td class="org-left">List all current yasnippets for inserting</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-orgheadline16" class="outline-3">
<h3 id="orgheadline16"><span class="section-number-3">4.4</span> Auto-yasnippet</h3>
<div class="outline-text-3" id="text-4-4">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Key Binding</th>
<th scope="col" class="org-left">Description</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><code>SPC i S c</code></td>
<td class="org-left">create a snippet from an active region</td>
</tr>

<tr>
<td class="org-left"><code>SPC i S e</code></td>
<td class="org-left">Expand the snippet just created with <code>SPC i y</code></td>
</tr>

<tr>
<td class="org-left"><code>SPC i S w</code></td>
<td class="org-left">Write the snippet inside <code>private/snippets</code> directory for future sessions</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2015-11-23 Mon 13:48</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
